In [1]:
import pandas as pd

In [38]:
df1=pd.DataFrame(
    {"emp_id":[1,2,5,4],'Name': ["Alex","John","Abhishek","Watson"], 'Age': [25,30,24,20]})

In [39]:
df1

   emp_id      Name  Age
0       1      Alex   25
1       2      John   30
2       5  Abhishek   24
3       4    Watson   20

In [40]:
df2=pd.DataFrame(    
    {"emp_id":[1,2,3,4],'Name': ["Alex","John","Krishna","Abhishek"], 'Weight': [60,65,70,75]})

In [41]:
df2

   emp_id      Name  Weight
0       1      Alex      60
1       2      John      65
2       3   Krishna      70
3       4  Abhishek      75

# Inner

In [11]:
pd.merge(df1,df2,how="inner",on=["Name"])

   emp_id_x      Name  Age  emp_id_y  Weight
0         1      Alex   25         1      60
1         2      John   30         2      65
2         5  Abhishek   24         4      75

# Outer

In [19]:
pd.merge(df1,df2,how="outer",on=["Name"])

   emp_id_x      Name   Age  emp_id_y  Weight
0       1.0      Alex  25.0       1.0    60.0
1       2.0      John  30.0       2.0    65.0
2       5.0  Abhishek  24.0       4.0    75.0
3       4.0    Watson  20.0       NaN     NaN
4       NaN   Krishna   NaN       3.0    70.0

# Left

In [25]:
pd.merge(df1,df2,how="left",on=["Name"])

   emp_id_x      Name  Age  emp_id_y  Weight
0         1      Alex   25       1.0    60.0
1         2      John   30       2.0    65.0
2         5  Abhishek   24       4.0    75.0
3         4    Watson   20       NaN     NaN

# Right

In [27]:
pd.merge(df1,df2,how="right",on=["Name"])

   emp_id_x      Name   Age  emp_id_y  Weight
0       1.0      Alex  25.0         1      60
1       2.0      John  30.0         2      65
2       5.0  Abhishek  24.0         4      75
3       NaN   Krishna   NaN         3      70

In [30]:
df1=pd.DataFrame(
    {"emp_id":[1,2,5,4],'Name_d1': ["Alex","John","Abhishek","Watson"], 'Age': [25,30,24,20]})

In [31]:
df2=pd.DataFrame(    
    {"emp_id":[1,2,3,4],'Name_d2': ["Alex","John","Krishna","Abhishek"], 'Weight': [60,65,70,75]})

In [32]:
df1

   emp_id   Name_d1  Age
0       1      Alex   25
1       2      John   30
2       5  Abhishek   24
3       4    Watson   20

In [33]:
df2

   emp_id   Name_d2  Weight
0       1      Alex      60
1       2      John      65
2       3   Krishna      70
3       4  Abhishek      75

# left_on and right_on

In [35]:
pd.merge(df1,df2,how="inner",left_on="Name_d1",right_on="Name_d2")

   emp_id_x   Name_d1  Age  emp_id_y   Name_d2  Weight
0         1      Alex   25         1      Alex      60
1         2      John   30         2      John      65
2         5  Abhishek   24         4  Abhishek      75

# Concat

In [57]:
df1=pd.DataFrame(    
    {"emp_id":[1,2,3,4],'Name': ["Alex","John","Krishna","Abhishek"], 'Age': [25,30,40,45]})

In [58]:
df2=pd.DataFrame(    
    {"emp_id":[5,6],'Name': ["Krishna","Watson"], 'Age': [30,35]})

In [59]:
df1

   emp_id      Name  Age
0       1      Alex   25
1       2      John   30
2       3   Krishna   40
3       4  Abhishek   45

In [60]:
df2

   emp_id     Name  Age
0       5  Krishna   30
1       6   Watson   35

In [64]:
pd.concat([df1,df2],axis=0)

   emp_id      Name  Age
0       1      Alex   25
1       2      John   30
2       3   Krishna   40
3       4  Abhishek   45
0       5   Krishna   30
1       6    Watson   35

In [65]:
pd.concat([df1,df2],axis=1)

   emp_id      Name  Age  emp_id     Name   Age
0       1      Alex   25     5.0  Krishna  30.0
1       2      John   30     6.0   Watson  35.0
2       3   Krishna   40     NaN      NaN   NaN
3       4  Abhishek   45     NaN      NaN   NaN